{"summary":"This paper proposes an image compression enhancement framework for edge devices called Easz, which uses the ‘erase-and-squeeze’ technique to improve compression flexibility and efficiency.","soundness":"2: fair","presentation":"2: fair","contribution":"2: fair","strengths":"It seems reasonable to downsample the original image to reduce the coding complexity at the transmitter side.","weaknesses":"Under the experimental conditions where GT images are available, relying on no-reference metrics to assess the reconstruction quality will result in an incomplete assessment and make it difficult to clearly demonstrate the advantages of the method in preserving image details. Reference metrics can provide more direct quantitative comparisons in the presence of GT, so the inclusion of metrics such as PSNR and SSIM in the paper will make the experimental results more convincing and comparable.\n\nThe NN-based image compression models compared in this article all use autoregressive context modules, thus resulting in coding and decoding times that can be very long, and the authors need to compare them with parallel context modules (e.g. checkerboard [1])..\n\nHigher complexity occurs on the receiver side using transformer reconstruction, especially for HD images. The complexity calculation in Supplementary Material Section B seems to be wrong. If the patch size is \n, then the dim should be \n, so the complexity of the model is not reduced.\n\n[1] He, Dailan, et al. \"Checkerboard context model for efficient learned image compression.\" Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition. 2021.","questions":"JPEG is inherently non-differentiable, how can the presence of JPEG compression be taken into account in training?","ethics_flag":"No ethics review needed.","ethics_concerns":null,"rating":"3: reject, not good enough","confidence":"5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully.","code_of_conduct":true}