{"summary":"The authors have proposed Constant Q Cepstral Coefficients (CQCC) as a measure to identify neurodegenerative diseases (like Parkinson’s and Amyotrophic lateral sclerosis). The proposed measure is compared against basic acoustic features Jitter Shimmer Teager Energy and MFCC using traditional machine learning classifiers like random forest and Support vector machines. The discriminator power of CQCC is demonstrated using two different datasets i.e. Italian Parkinson’s Voice and Speech dataset and Minsk2019 ALS database.","soundness":"3: good","presentation":"2: fair","contribution":"3: good","strengths":"The paper contributes towards developing interpretable features representation for neurodegenerative diseases.\nA comparison with mostly commonly used features like MFCC\nevaluation on two different languages and diseases.\nachievement of significant performance over widely used feature sets by neurodegenerative research community.\ndemonstration of improved class separation of CQCC over MFCC using LDA plots.","weaknesses":"hyperparameter optimization is not performed.\nit is not clear what is the dimensionality of each feature set, consider adding a table or paragraph in the methodology section detailing the dimensionality of each feature set used.\nHave you considered discussing the trade-offs between your approach and deep learning methods like wav2vec or BERT? This could help contextualize your choice of method and highlight any advantages in terms of interpretability or computational efficiency.\nAs the research field lacks large amount of datasets. In the limitations section, could you discuss how the scarcity of large datasets in this field might impact the generalizability of the findings, and what implications this has for future research?\nCould you provide more context in the methodology section about why these specific traditional feature sets were chosen for comparison? Are there particular characteristics of these features that make them relevant benchmarks for neurodegenerative disease detection?\nconsider adding more references","questions":"why and how your proposed feature is helpful?\nwhat characteristic of speech the features are representing and how they represent neurodegeneration in speech (interpretability for clinicians?)\nwhy you have not performed fusion of features?\nany computational cost advantages?\nexplain dimensionality of feature sets and the time window for extraction of features, and how did you generate a representation for an audio recording.\nhow did you handle the variable duration of audio recordings?","ethics_flag":"No ethics review needed.","ethics_concerns":null,"rating":"6: marginally above the acceptance threshold","confidence":"4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.","code_of_conduct":true}