{"summary":"Authors describe a benchmark for dark patterns: brand bias, user retention, anthropomorphization, sneaking, sycophancy and harmful generation. They created prompts designed to elicit the dark patterns. Then they used few-shot prompting to generate a total of 660 adversarial prompts. Using a mixture of human annotation and model annotation (Claude Sonnet, Gemini Pro, GPT-4o, and Llama3 70b) they tested 14 open and closed lmms. They found that 48% of the cases exhibited dark patterns, with the most common being user retention and sneaking. Dark patterns presence ranged from 30% to 61% across all models.","soundness":"2: fair","presentation":"3: good","contribution":"3: good","strengths":"The paper is well-written and well-organized. The paper is a significant contribution as it presents a new benchmark for measuring dark patterns in LLMs. This is an important direction to help evaluate model safety. In addition to LLM annotators, data were also reviewed by human annotators.","weaknesses":"Unfortunately, the methods aren’t clear on the decision criteria, what makes a model’s performance count? Ought it be a simple proportion? Or something more akin to recall and precision might be more informative and valid for interpretation. Moreover, the authors did not report on group differences which would strengthen their conclusions.","questions":"p. 5 243 “Our results can be found in Figure 4. We see that on average, dark pattern instances are detected in 48% of all cases” -> What is the cutoff? How are models classified as exhibiting a dark pattern or not? Are the differences significant?\n\nP.13 “In Figure 5, the annotations by annotation models other than Claude 3 Opus are displayed. The general trends of the annotations are similar. Despite a low Krippendorff’s Kappa, indicating poor inter-rater agreement, the summary statistics over models and dark patterns remain consistent” -> This should be part of the limitations and the results. What are the scores within/between models and humans?","ethics_flag":"No ethics review needed.","ethics_concerns":null,"rating":"8: accept, good paper","confidence":"4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.","code_of_conduct":true}