{"summary":"This paper introduces Stochastic Sparse Sampling (SSS), a new framework for classifying variable-length medical time series. SSS employs fixed windows sparsely to make local predictions, which are then combined to form a global prediction.","soundness":"2: fair","presentation":"2: fair","contribution":"1: poor","strengths":"Seizure onset zone (SOZ) detection is a novel direction that may be important for clinical intracranial EEG (iEEG) research.\nThe method is described in detail, ensuring clarity and reproducibility.\nThe experiments use a large-scale public iEEG dataset for evaluation, showing the robustness and effectiveness across diverse and heterogeneous data sources.","weaknesses":"This paper uses a single-channel approach for SOZ detection, justifying it by citing the challenges posed by varying numbers of iEEG channels across iEEG recordings. However, this reason does not demonstrate that single-channel analysis is more effective. In clinical practice, SOZ and early propagation zones involve multiple channels with timing differences in abnormal discharges [1]. The authors do not provide sufficient theoretical or experimental support to explain why a single-channel approach would effectively capture these critical distinctions.\nThis paper defines SOZ detection as a variable-length time series classification (VTSC) task. Still, the authors do not clarify the specific benefits of VTSC over general anomaly detection for this application. Their justification, that “effective treatment requires analysis of variable-length signals,” lacks concrete references or explanations relevant to variable-length signals, weakening the rationale for using VTSC in this context.\nThe proposed method is quite simple. How does it differ from other downsampling or sparse sampling approaches? Model output still provides a global classification result, which seems no different from a standard classification model. The paper should compare its approach with more methods that share a similar motivation and more details of related works to clarify its position within the research field.\nThe authors state in the abstract that their method outperforms \"state-of-the-art (SOTA) baselines across most medical centers.\" However, none of these baselines were designed for the SOZ detection task or medical time series data.Instead, all baseline models were built for general time series or other sequential data forecasting tasks, not even for time series classification. The authors should have used baselines developed for iEEG or EEG signal analysis, such as methods in references [2-4], or, at the very least, models designed for time series classification or anomaly detection [4,5].\n[1] Li et al., Neural fragility as an EEG marker of the seizure onset zone, Nature Neuroscience, 2021.\n\n[2] Tang et al., Self-Supervised Graph Neural Networks for Improved Electroencephalographic Seizure Analysis, ICLR, 2022.\n\n[3] Luo et al., Exploring Adaptive Graph Topologies and Temporal Graph Networks for EEG-Based Depression Detection, IEEE Transactions on Neural System and Rehabilitation Engineering, 2023.\n\n[4] Rikuto et al., SplitSEE: A Splittable Self-supervised Framework for Single-Channel EEG Representation Learning, ICDM, 2024.\n\n[5] tang et al., Omni-Scale CNNs: a simple and effective kernel size configuration for time series classification, ICLR, 2022.\n\n[6] Lu et al., Out-of-Distribution Representation Learning for Time Series Classification, ICLR, 2023.","questions":"My main concern is the motivation. Clinically, the brain regions requiring surgical removal include the SOZ and early propagation zones. These areas contain numerous neurons that exhibit abnormal discharges and are typically distributed across multiple iEEG channels. These regions show the earliest electrophysiological changes in a seizure, often before clinical symptoms appear. Suppose the model can only consider a single iEEG data channel. In that case, it may miss the timing differences of abnormal discharges across channels, making it difficult to determine which neurons initiated the seizure. Experts have developed many graph topology-based methods and biomarkers to capture these distinctions. In this paper, the authors justify their choice of a single-channel approach by explaining that varying numbers of iEEG channels across recordings create challenges for developing multi-channel analysis methods. However, this limitation alone does not prove that single-channel analysis is more effective. Could the authors offer more theoretical or experimental support to justify the potential effectiveness of a single-channel method?","ethics_flag":"No ethics review needed.","ethics_concerns":null,"rating":"3: reject, not good enough","confidence":"4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.","code_of_conduct":true}