{"summary":"This paper proposes a multi-agent RL method to enable communication between multiple intersections using sequence modeling. It also introduces a pipeline for dataset and road network generation. It further tries to handle issues with minimal state information.","soundness":"2: fair","presentation":"1: poor","contribution":"2: fair","strengths":"The originality is good. It aims to solve some real-world problems in current traffic signal control research, such as varying network and intersection structures, multi-intersection coordination, and the lack of expensive sensor-captured data.","weaknesses":"The abstract doesn’t provide enough information about the problem, method, and contributions.\nFigures 5 and 6 both contain irrelevant parts in the screenshots. Moreover, the authors should use high-definition figures instead of screenshots.\nIt’s not clear what the “difference in vehicle waiting time” means in the reward setting in Line 159.\nThis paper states that one major contribution is the dataset, traffic flow and road network generation. However, how you generate them is not clearly explained.\nThere are not any latest baseline methods for comparison.\nNo uncertainty evaluation for any experimental results. Multiple runs are necessary for model evaluation.\nThe experiments lack comprehensiveness, and the analysis does not provide sufficiently convincing insights.\nNo code or implementation details are provided.","questions":"In line 247, the Transformer model used in this paper assumes access to global information. As far as I know, information sharing is highly limited. Is global sharing reasonable in traffic signal control problems?","ethics_flag":"No ethics review needed.","ethics_concerns":null,"rating":"3: reject, not good enough","confidence":"4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.","code_of_conduct":true}