{"summary":"The paper presents a Novel Traffic Sign Control approach in a multi-agent setting by modelling communication as a sequence problem and allowing road networks to communicate. The model uses Graph Neural Networks to handle road network topologies and demonstrate that their approach can provide competitive performance despite minimal state information.\n\nThe paper presets:\n\nAn automated pipeline for dataset generation\n\nUtilize a Transformer to model inter-agent dependencies by encoding state history.\n\nCapability to model non-uniform input size based on number of intersections and intersection sizes.\n\nA Model that can provide competitive performance to baselines without using expensive sensors.","soundness":"2: fair","presentation":"3: good","contribution":"3: good","strengths":"Experiments are done in both simple and complex network designs and show that ththe results are comparable to models that contain more information.\n\nLane encoding is clearly presented in Figure 1.\n\nUtilizing existing Traffic Simulation models to verify the capabilities.","weaknesses":"It is unclear how the Graph Neural Network is used in this paper.\n\nLength of the Sequences for the provided results is not mentioned. It is unclear how the transformer based model would perform for longer sequences.\n\nPage limit is exceeded as per Lines 423 to 427.","questions":"How does the Communication model differ from Graph Based Multi-Agent Communication method presented in Seraj et al 2022 [1]?\n\nCan this model be used to inform the future design choices in urban transportation by iterative development and evaluation in order to increase the efficiency of the traffic flow?\n\n[1] Seraj, Esmail, et al. Learning Efficient Diverse Communication for Cooperative Heterogeneous Teaming. No. SAND2022-4579C. Sandia National Lab.(SNL-NM), Albuquerque, NM (United States), 2022.","ethics_flag":"No ethics review needed.","ethics_concerns":null,"rating":"5: marginally below the acceptance threshold","confidence":"3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.","code_of_conduct":true}