{"summary":"This paper presents a Feature-Aware Federated Learning framework for anomaly detection in 5G networks, addressing challenges of data privacy and scalability. The framework incorporates feature importance into model aggregation using integrated gradients to compute feature relevance, with differential privacy to protect client data. Additionally, a Dynamic Feature Importance Adaptation (DFIA) mechanism periodically updates feature importance to adapt to changing data distributions. Experiments show that this approach outperforms traditional federated methods like FedAvg and FedProx in unsupervised anomaly detection tasks, achieving improved accuracy, robustness, and privacy preservation.","soundness":"2: fair","presentation":"2: fair","contribution":"2: fair","strengths":"Strengths:\n\nThis work offers a Feature-Aware Federated Learning framework for anomaly detection in 5G networks, addressing challenges of data privacy and scalability.","weaknesses":"Weaknesses:\n\nThe novelty of this paper needs to be further improved.\nThe experimental results of this paper are not convincing.\nMore STOA baselines need to be included.\nThe writing quality of this paper needs another round of polishing.","questions":"The writing style of this paper suggests it may have been generated by an LLM, as it includes many informal expressions that are uncommon in academic manuscripts. It is recommended that the authors thoroughly review the language and expressions used throughout the text.\n\nThe novelty of this paper needs further strengthening. Currently, the approach mainly combines existing techniques—feature-aware aggregation and differential privacy—without a clear distinction from previous works. The authors should further elaborate on the differences and connections between their proposed method and related work to emphasize its unique contributions.\n\nThe paper should include more advanced baselines. In the experimental results, the authors compare only with FedProx and omit comparisons with existing advanced FL-based anomaly detection baselines, which limits the ability to demonstrate the superiority of the proposed approach.\n\nThe accuracy of the experimental results needs further explanation. Introducing DP mechanisms typically results in a decrease in model accuracy, yet the results in this paper do not reflect this and even exceed FedAvg. Additionally, the paper should provide a detailed description of experimental settings, including learning rate, dataset size, training rounds, and other hyperparameters. Ablation experiments should be conducted to clarify the contribution of each individual component, which will aid readers in understanding the impact of each on the method's performance.\n\nFinally, the experimental results lack persuasiveness in terms of baselines, dataset size, dataset configurations, and parameter sensitivity analysis. The authors should consider conducting additional experiments to enhance the credibility of the experimental findings.","ethics_flag":"No ethics review needed.","ethics_concerns":null,"rating":"3: reject, not good enough","confidence":"5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully.","code_of_conduct":true}