{"summary":"Federated learning provides a decentralised solution for anomaly detection in 5G networks, but neglects the importance of feature relevance and privacy preservation during model aggregation. This paper presents a federated learning framework for 5G networks, incorporating feature importance to improve anomaly detection. It uses integrated gradients to determine feature relevance and dynamically adapts to changing data distributions, integrating differential privacy to secure data. Experiments on real-world 5G network datasets show the advantages of the FAFL framework in terms of anomaly detection accuracy and robustness.","soundness":"2: fair","presentation":"1: poor","contribution":"2: fair","strengths":"1、The proposed framework effectively addresses conditional joint learning methods in the context of data heterogeneity, lack of labelling, privacy issues and dynamic environment challenges faced in 5G network scenarios. 2、The paper considers the protection of customer privacy by applying differential privacy when aggregating cross-customer feature importance to prevent leakage of sensitive information. 3、The paper utilises a 5G testbed environment containing two 5G cores to collect datasets and conduct experiments with a certain degree of authenticity and credibility that are relevant.","weaknesses":"1、The applicable scenario of the proposed method is unclear. Further clarification is necessary. 2、The paper lacks innovation, appearing as a fusion of multiple existing technologies rather than presenting original contributions. 3、This paper compares a limited number of methods, necessitating the inclusion of additional federated anomaly detection techniques to enhance its persuasive ability. Furthermore, while the paper discusses differential privacy, it fails to conduct privacy attack experiments to substantiate the need for this mechanism. Additionally, the paper lacks a comprehensive experimental analysis. 4、This paper resembles a scientific report more than an academic publication. It lacks standardization in language, contains several writing errors ( line 126 ), and fails to provide a detailed description of the proposed framework. 5、The paper does not align well with the conference theme and fails to address the domains of representation learning and deep learning.","questions":"Please see the weaknesses section.","ethics_flag":"No ethics review needed.","ethics_concerns":null,"rating":"3: reject, not good enough","confidence":"4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.","code_of_conduct":true}